package LessonFirstHomeWork;

import org.junit.jupiter.api.Test;

/**
 * Ex3: Создание репозитория
 *
 * В дальнейшем мы будем все домашние заданий сдавать в виде ссылок на коммиты в Github. Так что давайте к этому подготовимся.
 *
 * Создайте проект в IDEA. Напишите программу, которая выводит: “Hello from <ваше_имя>”.
 *
 * На Github создайте репозиторий LearnQA_Java_API и выложите проект туда. Не забудьте сделать репозиторий публичным.
 *
 * Ответом к заданию будет ссылка на ваш репозиторий.
 */
public class ExThirdTest {
    @Test
    public  void HelloWorldTest(){
        System.out.println("Hello from \u004B\u0075\u0064\u006C\u0061\u0069\u0020\u0045\u0076\u0067\u0065\u006E\u0069\u0069");
    }
}